tutorials4NF/steadyStateForcedConvection4NF/parabolicTroughCollectorHybridHomogenous/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;//It is not read.

nu		nu [0 2 -1 0 0 0 0]	1.0e-23;//It is not read.
Pr		Pr [ 0 0 0 0 0 0 0 ]	1.0e-23;//It is not read.
Prt		Prt [ 0 0 0 0 0 0 0 ]	0.85;
Sct		Sct [ 0 0 0 0 0 0 0 ]	0.85;
// ************************************************************************* //
