tutorials4NF/steadyStateForcedConvection4NF/parabolicTroughCollectorHybridHomogenous/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	type		fixedValue;
	value		$internalField;
    }

    outlet
    {
	type		zeroGradient;
    }

    tube
    {
        type            alphatWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
