tutorials4NF/steadyStateForcedConvection4NF/parabolicTroughCollectorHybridHomogenous/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform .32032184328677080050;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    1.00;
        phi             phi;
        k               k;
        value           uniform .32032184328677080050;
    }

    outlet
    {
        type            zeroGradient;
    }

    tube
    {
        type            epsilonWallFunction;
        refValue        uniform 0;
        value           uniform .32032184328677080050;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
}


// ************************************************************************* //
